; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v2 ?v10)
             (pred_9 ?v13 ?v7)
             (pred_2 ?v2 ?v7)
             (pred_7 ?v3 ?v2 )
	     (pred_12 ?v2)
             (pred_4 ?v6)
             (pred_10 ?v13)
             (pred_8 ?v7)
             (pred_3 ?v2)
             (pred_1 ?v13)
             (pred_5 ?v2)
             (pred_6 ))



(:action op_4
:parameters (?v12 ?v5 ?v9 ?v8)
:precondition (and (pred_4 ?v12) (pred_4 ?v5) (pred_10 ?v9) (pred_8 ?v8)
          (pred_11 ?v12 ?v5) (pred_9 ?v9 ?v8)
                   (pred_2 ?v5 ?v8) (pred_12 ?v12) 
                   (pred_3 ?v5) (pred_1 ?v9))
:effect (and  (pred_5 ?v5) (not (pred_3 ?v5))))


(:action op_5
:parameters (?v12 ?v1)
:precondition (and (pred_4 ?v12) (pred_4 ?v1)
               (pred_12 ?v12) (pred_11 ?v12 ?v1) (pred_5 ?v1))
:effect (and (pred_12 ?v1) (not (pred_12 ?v12))))

(:action op_3
:parameters (?v12 ?v9)
:precondition (and (pred_4 ?v12) (pred_10 ?v9) 
                  (pred_12 ?v12) (pred_7 ?v9 ?v12) (pred_6 ))
:effect (and (pred_1 ?v9)
   (not (pred_7 ?v9 ?v12)) (not (pred_6 ))))


(:action op_2
:parameters (?v12 ?v11 ?v4)
:precondition (and (pred_4 ?v12) (pred_10 ?v11) (pred_10 ?v4)
                  (pred_12 ?v12) (pred_1 ?v4) (pred_7 ?v11 ?v12))
:effect (and (pred_1 ?v11) (pred_7 ?v4 ?v12)
        (not (pred_1 ?v4)) (not (pred_7 ?v11 ?v12))))

(:action op_1
:parameters (?v12 ?v9)
:precondition (and (pred_4 ?v12) (pred_10 ?v9) 
                  (pred_12 ?v12) (pred_1 ?v9))
:effect (and (pred_6 ) (pred_7 ?v9 ?v12) (not (pred_1 ?v9)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_15 obj_14 obj_12 obj_17 obj_25 obj_08 obj_23 obj_02 obj_07 obj_19 obj_10 obj_31 obj_05 obj_06 obj_18 obj_04 obj_03 obj_01 obj_27 obj_30 obj_24 obj_29 obj_11 obj_21 obj_22
    obj_09 obj_13 obj_20
    obj_16 obj_28 obj_26
    )

    (:init
       (pred_6)

       (pred_4 obj_15)
       (pred_4 obj_14)
       (pred_4 obj_12)
       (pred_4 obj_17)
       (pred_4 obj_25)
       (pred_4 obj_08)
       (pred_4 obj_23)
       (pred_4 obj_02)
       (pred_4 obj_07)
       (pred_4 obj_19)
       (pred_4 obj_10)
       (pred_4 obj_31)
       (pred_4 obj_05)
       (pred_4 obj_06)
       (pred_4 obj_18)
       (pred_4 obj_04)
       (pred_4 obj_03)
       (pred_4 obj_01)
       (pred_4 obj_27)
       (pred_4 obj_30)
       (pred_4 obj_24)
       (pred_4 obj_29)
       (pred_4 obj_11)
       (pred_4 obj_21)
       (pred_4 obj_22)
       (pred_8 obj_09)
       (pred_8 obj_13)
       (pred_8 obj_20)
       (pred_10 obj_16)
       (pred_10 obj_28)
       (pred_10 obj_26)

       (pred_11 obj_15 obj_08)
       (pred_11 obj_15 obj_14)
       (pred_11 obj_14 obj_23)
       (pred_11 obj_14 obj_12)
       (pred_11 obj_14 obj_15)
       (pred_11 obj_12 obj_02)
       (pred_11 obj_12 obj_17)
       (pred_11 obj_12 obj_14)
       (pred_11 obj_17 obj_07)
       (pred_11 obj_17 obj_25)
       (pred_11 obj_17 obj_12)
       (pred_11 obj_25 obj_19)
       (pred_11 obj_25 obj_17)
       (pred_11 obj_08 obj_10)
       (pred_11 obj_08 obj_23)
       (pred_11 obj_08 obj_15)
       (pred_11 obj_23 obj_31)
       (pred_11 obj_23 obj_02)
       (pred_11 obj_23 obj_14)
       (pred_11 obj_23 obj_08)
       (pred_11 obj_02 obj_05)
       (pred_11 obj_02 obj_07)
       (pred_11 obj_02 obj_12)
       (pred_11 obj_02 obj_23)
       (pred_11 obj_07 obj_06)
       (pred_11 obj_07 obj_19)
       (pred_11 obj_07 obj_17)
       (pred_11 obj_07 obj_02)
       (pred_11 obj_19 obj_18)
       (pred_11 obj_19 obj_25)
       (pred_11 obj_19 obj_07)
       (pred_11 obj_10 obj_04)
       (pred_11 obj_10 obj_31)
       (pred_11 obj_10 obj_08)
       (pred_11 obj_31 obj_03)
       (pred_11 obj_31 obj_05)
       (pred_11 obj_31 obj_23)
       (pred_11 obj_31 obj_10)
       (pred_11 obj_05 obj_01)
       (pred_11 obj_05 obj_06)
       (pred_11 obj_05 obj_02)
       (pred_11 obj_05 obj_31)
       (pred_11 obj_06 obj_27)
       (pred_11 obj_06 obj_18)
       (pred_11 obj_06 obj_07)
       (pred_11 obj_06 obj_05)
       (pred_11 obj_18 obj_30)
       (pred_11 obj_18 obj_19)
       (pred_11 obj_18 obj_06)
       (pred_11 obj_04 obj_24)
       (pred_11 obj_04 obj_03)
       (pred_11 obj_04 obj_10)
       (pred_11 obj_03 obj_29)
       (pred_11 obj_03 obj_01)
       (pred_11 obj_03 obj_31)
       (pred_11 obj_03 obj_04)
       (pred_11 obj_01 obj_11)
       (pred_11 obj_01 obj_27)
       (pred_11 obj_01 obj_05)
       (pred_11 obj_01 obj_03)
       (pred_11 obj_27 obj_21)
       (pred_11 obj_27 obj_30)
       (pred_11 obj_27 obj_06)
       (pred_11 obj_27 obj_01)
       (pred_11 obj_30 obj_22)
       (pred_11 obj_30 obj_18)
       (pred_11 obj_30 obj_27)
       (pred_11 obj_24 obj_29)
       (pred_11 obj_24 obj_04)
       (pred_11 obj_29 obj_11)
       (pred_11 obj_29 obj_03)
       (pred_11 obj_29 obj_24)
       (pred_11 obj_11 obj_21)
       (pred_11 obj_11 obj_01)
       (pred_11 obj_11 obj_29)
       (pred_11 obj_21 obj_22)
       (pred_11 obj_21 obj_27)
       (pred_11 obj_21 obj_11)
       (pred_11 obj_22 obj_30)
       (pred_11 obj_22 obj_21)
       (pred_3 obj_12)
       (pred_3 obj_27)
       (pred_3 obj_17)
       (pred_2  obj_12 obj_09)
       (pred_2  obj_27 obj_13)
       (pred_2  obj_17 obj_20)
       (pred_5 obj_15)
       (pred_5 obj_14)
       (pred_5 obj_25)
       (pred_5 obj_08)
       (pred_5 obj_23)
       (pred_5 obj_02)
       (pred_5 obj_07)
       (pred_5 obj_19)
       (pred_5 obj_10)
       (pred_5 obj_31)
       (pred_5 obj_05)
       (pred_5 obj_06)
       (pred_5 obj_18)
       (pred_5 obj_04)
       (pred_5 obj_03)
       (pred_5 obj_01)
       (pred_5 obj_30)
       (pred_5 obj_24)
       (pred_5 obj_29)
       (pred_5 obj_11)
       (pred_5 obj_21)
       (pred_5 obj_22)

       (pred_9  obj_16 obj_09)
       (pred_9  obj_28 obj_13)
       (pred_9  obj_26 obj_20)
       (pred_7 obj_16 obj_19)
       (pred_7 obj_28 obj_19)
       (pred_7 obj_26 obj_04)
       (pred_12 obj_23)
    )

    (:goal (and
       (pred_7 obj_26 obj_25)
    ))
(:constraints
  (always (not (pred_12 obj_10)))
)
)

; plan
1. (op_5 obj_23 obj_31)
   deleted: (pred_12 obj_23)
   added: (pred_12 obj_31)
   goals met: 0 of 1
2. (op_5 obj_31 obj_03)
   deleted: (pred_12 obj_31)
   added: (pred_12 obj_03)
   goals met: 0 of 1
3. (op_5 obj_03 obj_04)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_04)
   goals met: 0 of 1
4. (op_3 obj_04 obj_26)
   deleted: (pred_7 obj_26 obj_04) (pred_6)
   added: (pred_1 obj_26)
   goals met: 0 of 1
5. (op_5 obj_04 obj_03)
   deleted: (pred_12 obj_04)
   added: (pred_12 obj_03)
   goals met: 0 of 1
6. (op_5 obj_03 obj_31)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_31)
   goals met: 0 of 1
7. (op_5 obj_31 obj_23)
   deleted: (pred_12 obj_31)
   added: (pred_12 obj_23)
   goals met: 0 of 1
8. (op_5 obj_23 obj_02)
   deleted: (pred_12 obj_23)
   added: (pred_12 obj_02)
   goals met: 0 of 1
9. (op_5 obj_02 obj_07)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_07)
   goals met: 0 of 1
10. (op_5 obj_07 obj_19)
   deleted: (pred_12 obj_07)
   added: (pred_12 obj_19)
   goals met: 0 of 1
11. (op_5 obj_19 obj_25)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_25)
   goals met: 0 of 1
12. (op_1 obj_25 obj_26)
   deleted: (pred_1 obj_26)
   added: (pred_6) (pred_7 obj_26 obj_25)
   goals met: 1 of 1
